Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/employment_rights_and_conditions/health_and_safety/workplace_accidents_or_injuries.html.txt.tmx
Source language: en
Languages: ga

source: Workplace accidents or injuries
ga: Timpistí nó gortuithe sa láthair oibre

source: If you have an accident while at work or on your way to work, you need to find out what you should do
ga: Má bhaineann timpiste duit agus tú i mbun oibre nó ar do bhealach chun na hoibre, caithfidh tú fáil amach céard ba cheart duit a dhéanamh

source: If necessary, you should seek medical help from your local general practitioner (GP/family doctor) or hospital
ga: Ba chóir duit cabhair leighis a lorg más gá ón lia-chleachtóir ginearálta is áitiúla agat nó ón ospidéal

source: You should report the accident to your employer
ga: Ba cheart duit an tionóisc a thuairisciú chuig d’fhostóir

source: Then you may need to check if there are any benefits or entitlements that you may be eligible for while you are out of work and what to expect when you return to work
ga: B’fhéidir go gcaithfeá ceadú ansin an bhfuil aon sochair nó teidlíochtaí ann dá bhféadfá bheith cáilithe agus tú as an obair, agus an méid a bheidh de dhíth ort chun filleadh ar an obair

source: The Safety, Health and Welfare at Work Acts 2005 and 2010 set out the rights and obligations of both employers and employees and provides for substantial fines and penalties for breaches of the health and safety legislation
ga: Is sna hAchtanna um Shábháilteacht, Sláinte agus Leas ag an Obair 2005 agus 2010 a leagtar amach na cearta agus na hoibleagáidí d’fhostóirí agus fostaithe araon, agus foráiltear iontu d’fhíneálacha agus pionóis as sáruithe den reachtaíocht sláinte agus sábháilteachta

source: You can read more in our document on health and safety at work
ga: Is féidir leat a thuilleadh a léamh inár gcáipéis faoin tsláinte agus faoin tsláinte agus sábháilteacht ag an obair

source: You should report an accident while on your way to work or while at work to your employer
ga: Ba chóir duit tionóisc a thuairisciú chuig d’fhostóir dá mba ar do bhealach chun na hoibre nó ag obair a bhí tú

source: An employer must report any accidents to the Health and Safety Authority when an employee is missing 3 consecutive days at work (not including the day of the accident)
ga: Caitheann fostóir tionóisc ar bith a thuairisciú don Údarás Sláinte agus Sábháilteachta nuair a bhíonn fostaí as láthair ar feadh 3 lá oibre as a chéile (nach n-áirítear lá na tionóisce leis)

source: Sick leave and sick pay
ga: Saoire bhreoiteachta agus pá breoiteachta

source: You should check if you have an entitlement to paid sick leave in the terms and conditions of your contract of employment
ga: Ba cheart duit ceadú an bhfuil teidlíocht agat ar shaoire bhreoiteachta le pá sna téarmaí agus coinníollacha le do chonradh fostaíochta

source: In general, an employee has no right under employment law to be paid while on sick leave
ga: Ní bhíonn aon cheart ag fostaí go hiondúil faoi dhlí na fostaíochta chun pá a fháil agus iad ar shaoire bhreoiteachta

source: There are a number of benefits which you may entitled to while you are out sick
ga: Tá roinnt sochar ann dá bhféadfá bheith i dteideal agus tú as láthair le breoiteacht

source: Occupational Injuries Benefit Scheme
ga: Scéim um Shochair Dhíobhálacha Ceirde

source: The Occupational Injuries Benefit Scheme is a group of benefits for people injured or incapacitated by an accident at work or while travelling directly to or from work
ga: Is grúpa sochar atá sa Scéim um Shochair Dhíobhálacha Ceirde do dhaoine gortaithe nó éagumasaithe le tionóisc ag an obair nó ar thaisteal dóibh go díreach chuig nó ón obair

source: Injury Benefit is a weekly payment made to you if you are unfit for work due to an accident at work or an accident while travelling (on an unbroken journey) directly to or from work
ga: Is íocaíocht sheachtainiúil atá sa Sochar Díobhála a dhéantar leatsa mura féidir leat dul ag an obair de bharr tionóisce ag an obair nó tionóisce agus tú ag taisteal (ar aistear neamhbhriste) go díreach chun na hoibre nó uaithi

source: Under the Medical Care Scheme you can claim certain medical costs that are not paid by the Health Service Executive (HSE) or covered by Treatment Benefit Scheme
ga: Is féidir leat costais leighis áirithe a éileamh faoin Scéim Cúraim Leighis nach n-íocann Feidhmeannacht na Seirbhíse Sláinte (FSS) ná nach gclúdaítear faoin Scéim Sochair Chóireála

source: Disablement Benefit can be paid to you if you suffer a loss of physical or mental faculty because of an accident at work, an accident travelling directly to or from work, or a prescribed disease contracted at work
ga: Is féidir Sochar Míthreorach a íoc leat má fhulaingíonn tú caillteanas d’acmhainn cholanda nó meabhrach mar thoradh ar thionóisc san obair, tionóisc ag taisteal go díreach chun na hoibre nó uaithi, nó galar forordaithe a tolgadh ag an obair

source: You can find out more about these and other payments under the scheme in our document on the Occupational Injuries Benefit Scheme
ga: Is féidir leat níos mó a fháil amach faoi na híocaíochtaí sin agus eile faoin scéim inár gcáipéis um an Scéim Sochair Dhíobhálacha Ceirde

source: You may get Illness Benefit from the Department of Social Protection if you cannot work because you are sick or ill
ga: Féadfaidh tú Sochar Breoiteachta a fháil ón Roinn Coimirce Sóisialaí mura féidir leat obair toisc go bhfuil tú tinn nó breoite

source: You must be aged under 66, covered by the appropriate class of social insurance (PRSI) and satisfy the PRSI conditions
ga: Caithfidh tú bheith faoi bhun 66 bliain d'aois, bheith clúdaithe leis an aicme árachais shóisialaigh (ÁSPC) cheart agus coinníollacha ÁSPC a shásamh

source: If you do not have enough PRSI contributions, you may qualify for Disability Allowance which is a means-tested payment
ga: Mura mbíonn dóthain ranníocaíochtaí ÁSPC agat, féadfaidh tú cáiliú don Liúntas Míchumais arb íocaíocht de réir tástála acmhainn í

source: You may qualify if you have an injury, disease or physical or mental disability that has continued or may be expected to continue for at least one year
ga: Féadann tú cáiliú má bhaineann díobháil, aicíd nó míchumas colanda nó meabhrach duit atá tar éis leanúint ar aghaidh nó a bhfuiltear ag dúil go leanfaidh siad ar aghaidh ar feadh bliain amháin ar a laghad

source: If you don’t qualify for Illness Benefit or Disability Allowance, you may be entitled to the basic Supplementary Welfare Allowance
ga: Mura gcáilíonn tú do Shochar Breoiteachta nó Liúntas Míchumais, féadfaidh tú bheith i dteideal an Bhunliúntais Leasa Fhorlíontaigh

source: If you have returned to work you can claim the basic Supplementary Welfare Allowance for up to 30 days while you are waiting for your wages
ga: Má fhill tú ar an obair is féidir leat an Bunliúntas Leasa Fhorlíontaigh a éileamh ar feadh chomh fada le 30 lá agus tú ag fanacht ar do phá

source: If you are out of work you may qualify for a credited contribution
ga: Mura mbíonn tú ag obair b’fhéidir go gcáilíonn tú i gcomhair ranníocaíochta curtha chun sochair

source: A credited social insurance contribution is a contribution given to you and recorded on your social insurance record
ga: Is ionann ranníocaíocht árachais shóisialaigh curtha chun sochair agus ranníocaíocht a thugtar duit agus a thaifeadtar ar do theist árachais shóisialaigh

source: Credit contributions are important because you may use them to help you qualify for a social insurance payment
ga: Baineann tábhacht le ranníocaíochtaí creidmheasa toisc gur féidir leat leas a bhaint astu chun cuidiú leat chun cáiliú i gcomhair íocaíochta árachais shóisialaigh

source: You may also get a tax refund if you are out of work due to illness
ga: Féadfaidh tú aisíocaíocht cánach a fháil freisin má bhíonn tú as an obair de bharr breoiteachta

source: This will depend on the length of time you have been unemployed, the amount of tax you have paid, the amount of tax credits you have used and the amount of your weekly social welfare payment
ga: Braithfidh sé sin ar an achar ama a bhí tú dífhostaithe, méid na cánach a d’íoc tú, méid na gcreidmheasanna cánach as ar bhain tú leas agus méid d’íocaíochta leasa shóisialaigh sheachtainiúla

source: Your employer may have taken out employers’ liability insurance cover
ga: B’fhéidir go bhfuair d’fhostóir clúdach árachais dliteanas fostóra

source: This cover enables employers to meet the cost of compensation for their employee’s injuries or illness which occur while their employees are working
ga: Cuireann an clúdach sin ar chumas na bhfostóirí chun costas an chúitimh a shásamh do dhíobhálacha nó breoiteacht a bhfostaithe, a tharlaíonn agus a gcuid fostaithe ag obair

source: You cannot seek compensation from your employer under the health and safety legislation but you can make a personal injury claim through InjuriesBoard.ie
ga: Ní féidir leat cúiteamh a lorg ó d’fhostóir faoin reachtaíocht sláinte agus sábháilteachta, ach is féidir leat éileamh chun díobháil phearsanta a ghnóthú trí InjuriesBoard.ie

source: If either you or your employer rejects the assessment the Board will issue you with an authorisation allowing you to make a claim through the civil courts
ga: Má dhiúltaíonn tú féin nó d'fhostóir do mheasúnú is amhlaidh a eiseoidh an Bord údarúchán duit ag ligean duit chun éileamh a thabhairt sna cúirteanna sibhialta

source: Your employer may have a sick leave and return to work policy to support a safe return for the employee who has had an illness or injury
ga: B’fhéidir go mbeadh beartas saoire bhreoiteachta agus filleadh ar an obair ag d’fhostóir chun tacú le filleadh sábháilte don fhostaí dár bhain breoiteacht nó díobháil

source: In terms of medical evidence you may be required to attend your employer's medical expert
ga: I dtéarmaí na fianaise leighis b'fhéidir go gcaithfeá freastal ar shaineolaí leighis d'fhostóra

source: If you become disabled through an accident or illness, your disability may require that your workplace be adapted or you may need special equipment in order to perform your job
ga: Má éiríonn tú míchumasaithe trí thionóisc nó breoiteacht éigin, d’fhéadfaí go gcaithfeá do láthair oibre a chur in oiriúint nó trealamh speisialta a fháil di chun is go bhfeidhmeoidh tú i do phost

source: You can read more in our document on working with a disability
ga: Is féidir leat a thuilleadh a léamh inár gcáipéis faoin obair le míchumas

source: Dismissal: If you are dismissed from your employment while on long-term certified sick leave, you may, under certain conditions, bring a claim for unfair dismissal against your employer
ga: Dífhostú: Má dhífhostaítear tú ó d’fhostaíocht agus tú ar shaoire bhreoiteachta dheimhnithe fhadtéarmach, is féidir leat éileamh a thabhairt faoi choinníollacha áirithe, chun éileamh a thabhairt ar dhífhostú éagórach i gcoinne d’fhostóra

source: If your illness is considered to be a disability under employment equality legislation, your rights under that particular legislation would also have to be taken into consideration
ga: Má mheastar do bhreoiteacht bheith ina míchumas faoin reachtaíocht don chomhionannas fostaíochta, is amhlaidh a chaithfí do chearta faoin reachtaíocht úd a thabhairt san áireamh freisin

source: The Workplace Relations Commission (WRC) has specific functions in relation to the implementation of employment laws
ga: Bíonn feidhmeanna sonrach ag An Coimisiún um Chaidreamh Oibreachais (CCO) i ndáil le forfheidhmiú na ndlíthe fostaíochta

source: You can contact the WRC’s Information and Customer Service for information about your employment rights
ga: Is féidir leat teagmháil a dhéanamh le Seirbhís Faisnéise agus Custaiméirí an CCO i gcomhair eolais faoi do chearta fostaíochta

source: The Health and Safety Authority is responsible for ensuring that workers (employed and self-employed) and people affected by work activity are protected from work-related injury and ill-health
ga: Is é an tÚdarás Sláinte agus Sábháilteachta a bhíonn freagrach as a chinntiú go dtugtar cosaint d’oibrithe (fostaithe agus féinfhostaithe) agus do dhaoine dá mbaineann gníomhaíocht oibre ó dhíobháil agus easláinte de bharr na hoibre

source: It provides information to employers, employees and self-employed people on workplace health and safety
ga: Soláthraíonn sé eolas d’fhostóirí, fostaithe agus daoine féinfhostaithe i leith na sláinte agus na sábháilteachta san ionad oibre

source: FLAC (Free Legal Advice Centres) is an independent, voluntary organisation that operates a network of legal advice clinics throughout the country
ga: Is eagras neamhspleách saorálach iad FLAC (Ionaid Chomhairle Dlí Saor in Aisce) a oibríonn líonra clinicí comhairle dlí ar fud na tíre

source: These clinics are confidential, free of charge and open to all
ga: Bíonn na clinicí seo rúnda, saor in aisce agus ar oscailt do chách

source: If you need legal advice, contact your nearest Citizens Information Centre for information on FLAC services in your area
ga: Má theastaíonn comhairle dlí uait, déan teagmháil leis an Ionad Eolais do Shaoránaigh is gaire duit i gcomhair eolais maidir le seirbhísí FLAC i do cheantar
